У тебя есть DataFrame deliveries, который содержит данные о доставках еды в ресторане.  
Твоя задача — написать функцию, которая:  
Группирует данные по delivery_date.  
Для столбца dish выполняет две агрегации:  
Подсчитывает количество уникальных блюд (unique_dishes).  
Подсчитывает общее количество доставок (включая повторяющиеся блюда) (total_deliveries).  
Возвращает DataFrame с колонками delivery_date, unique_dishes, total_deliveries, отсортированный по delivery_date по возрастанию.

In [3]:
import pandas as pd

data = [
    ['2023-07-01', 'Pizza'],
    ['2023-07-01', 'Pizza'],
    ['2023-07-01', 'Sushi'],
    ['2023-07-02', 'Burger'],
    ['2023-07-02', 'Pizza'],
    ['2023-07-03', 'Sushi'],
    ['2023-07-03', 'Sushi'],
    ['2023-07-03', 'Burger']
]
deliveries = pd.DataFrame(data, columns=['delivery_date', 'dish']).astype({'delivery_date': 'datetime64[ns]', 'dish': 'object'})

In [4]:
deliveries

  delivery_date    dish
0    2023-07-01   Pizza
1    2023-07-01   Pizza
2    2023-07-01   Sushi
3    2023-07-02  Burger
4    2023-07-02   Pizza
5    2023-07-03   Sushi
6    2023-07-03   Sushi
7    2023-07-03  Burger

In [18]:
deliveries.groupby('delivery_date', as_index=False)\
    ['dish']\
    .agg([('unique_dishes', 'nunique'),\
        ('total_deliveries', 'count')])\
    .sort_values('delivery_date')

  delivery_date  unique_dishes  total_deliveries
0    2023-07-01              2                 3
1    2023-07-02              2                 2
2    2023-07-03              2                 3

У тебя есть DataFrame со списком студентов и их баллов по экзамену. Нужно создать новый столбец "result", где будет написано "pass", если балл больше либо равен 60, и "fail", если меньше 60.

In [1]:
import pandas as pd
data = {
    "name": ["Аня", "Борис", "Вася", "Галя"],
    "score": [45, 82, 67, 53]
}
df = pd.DataFrame(data)

In [4]:
df

    name  score result
0    Аня     45   fail
1  Борис     82   pass
2   Вася     67   pass
3   Галя     53   fail

In [3]:
df["result"] = df["score"].apply(lambda x: "pass" if x >= 60 else "fail")

У тебя есть таблица с покупками в магазине: покупатель, категория товара и сумма покупки. Нужно найти:  
👉 среднюю сумму покупки по каждой категории,  
👉 а также добавить столбец "above_avg", который будет показывать "yes", если сумма конкретной покупки выше средней в её категории, и "no", если ниже или равна.

In [5]:
import pandas as pd

data = {
    "customer": ["Аня", "Борис", "Вася", "Галя", "Аня", "Борис"],
    "category": ["Фрукты", "Фрукты", "Фрукты", "Овощи", "Овощи", "Овощи"],
    "amount": [100, 150, 120, 80, 60, 90]
}

df = pd.DataFrame(data)

In [9]:
df

  customer category  amount above_avg
0      Аня   Фрукты     100        no
1    Борис   Фрукты     150       yes
2     Вася   Фрукты     120        no
3     Галя    Овощи      80       yes
4      Аня    Овощи      60        no
5    Борис    Овощи      90       yes

In [8]:
df["above_avg"] = df.groupby("category")["amount"].transform(
    lambda x: x > x.mean()
).map({True: "yes", False: "no"})

Представьте, что у вас есть DataFrame, содержащий информацию о сотрудниках. В нём есть столбец 'full_name', где указаны полные имена в формате "Имя Фамилия". Вам нужно создать новый столбец 'first_name', который будет содержать только имя сотрудника.  
Для решения этой задачи используйте .apply() вместе с lambda-функцией.

In [10]:
import pandas as pd

data = {'full_name': ['Анна Иванова', 'Пётр Петров', 'Елена Сидорова']}
df = pd.DataFrame(data)

In [16]:
df

        full_name first_name
0    Анна Иванова       Анна
1     Пётр Петров       Пётр
2  Елена Сидорова      Елена

In [15]:
df['first_name'] = df['full_name'].apply(lambda x: x.split()[0])

Представьте, что у вас есть DataFrame, содержащий данные о товарах. В нём есть столбец 'price' (цена), но все значения там — это числа в виде строк с символом валюты, например, "150 руб." или "5000 руб.". Ваша задача — создать новый столбец 'price_rub', где будут только числовые значения цены в рублях, уже в числовом формате.  
Для решения этой задачи также используйте .apply() вместе с lambda-функцией.

In [17]:
import pandas as pd

data = {'product': ['Футболка', 'Джинсы', 'Куртка'],
        'price': ['1500 руб.', '3500 руб.', '5000 руб.']}
df = pd.DataFrame(data)

In [26]:
df

    product      price price_rub
0  Футболка  1500 руб.      1500
1    Джинсы  3500 руб.      3500
2    Куртка  5000 руб.      5000

In [25]:
df['price_rub'] = df['price'].apply(lambda x: x.split()[0])

У вас есть DataFrame с данными о товарах. В нём есть столбец 'product_code', который содержит уникальные коды в формате "ABC-12345-DEF". Ваша задача — создать новый столбец 'short_code', который будет состоять только из числовой части кода. Например, для "ABC-12345-DEF" новым значением должно быть 12345.

In [28]:
import pandas as pd

data = {'product_name': ['Ноутбук', 'Мышь', 'Клавиатура'],
        'product_code': ['LAP-56789-PRO', 'MOU-12345-GAM', 'KEY-98765-OFF']}
df = pd.DataFrame(data)

In [34]:
df

  product_name   product_code  short_code
0      Ноутбук  LAP-56789-PRO       56789
1         Мышь  MOU-12345-GAM       12345
2   Клавиатура  KEY-98765-OFF       98765

In [33]:
df['short_code'] = df['product_code'].apply(lambda x: x.split('-')[1]).astype(int)

Представьте, что у вас есть DataFrame с данными о студентах. В нём есть столбец 'score' (балл за экзамен). Вам нужно создать новый столбец 'result', который будет содержать текстовый результат:  

"Сдано", если балл 50 или выше.  

"Не сдано", если балл ниже 50.

In [35]:
import pandas as pd

data = {'student': ['Анна', 'Пётр', 'Елена', 'Иван'],
        'score': [75, 45, 92, 30]}
df = pd.DataFrame(data)

In [38]:
df

  student  score    result
0    Анна     75     Сдано
1    Пётр     45  Не сдано
2   Елена     92     Сдано
3    Иван     30  Не сдано

In [37]:
df['result'] = df['score'].apply(lambda x: 'Сдано' if x >= 50 else 'Не сдано')

Представьте, что у вас есть DataFrame с данными о сотрудниках. В нём есть столбец 'salary' (зарплата) и 'experience_years' (опыт работы в годах). Вам нужно создать новый столбец 'bonus_rate', который будет рассчитывать размер бонуса в зависимости от этих двух параметров.  

Правила расчёта бонуса:  
Если опыт работы 5 лет и более И зарплата более 100 000, бонусная ставка — 0.15 (15%).  
Если опыт работы 5 лет и более И зарплата 100 000 или меньше, бонусная ставка — 0.10 (10%).  
Если опыт работы менее 5 лет, бонусная ставка — 0.05 (5%) независимо от зарплаты.

In [39]:
data = {'employee': ['Анна', 'Пётр', 'Елена', 'Иван', 'Мария'],
        'salary': [120000, 95000, 150000, 80000, 60000],
        'experience_years': [7, 6, 4, 9, 3]}
df = pd.DataFrame(data)

In [42]:
df

  employee  salary  experience_years  bonus_rate
0     Анна  120000                 7        0.15
1     Пётр   95000                 6        0.10
2    Елена  150000                 4        0.05
3     Иван   80000                 9        0.10
4    Мария   60000                 3        0.05

In [41]:
df['bonus_rate'] = df.apply(lambda row: 0.15 if row['experience_years'] >= 5 and row['salary'] > 100000
                                       else (0.10 if row['experience_years'] >= 5 and row['salary'] <= 100000
                                             else 0.05), axis=1)

У вас есть DataFrame с данными о проектах. В нём есть два столбца с датами: 'start_date' (дата начала) и 'end_date' (дата окончания), обе в строковом формате. Ваша задача — создать новый столбец 'project_status' со статусом каждого проекта.  

Правила определения статуса:  
Если проект завершился (end_date раньше сегодняшней даты), статус — "Завершён".  
Если проект ещё не начался (start_date позже сегодняшней даты), статус — "В ожидании".  
В остальных случаях (проект в процессе), статус — "В процессе"

In [43]:
import pandas as pd
from datetime import datetime

data = {'project_name': ['Веб-сайт', 'Мобильное приложение', 'База данных'],
        'start_date': ['2023-01-10', '2025-05-20', '2024-03-15'],
        'end_date': ['2023-05-15', '2025-10-30', '2024-12-01']}
df = pd.DataFrame(data)

# Преобразование строковых дат в формат datetime
df['start_date'] = pd.to_datetime(df['start_date'])
df['end_date'] = pd.to_datetime(df['end_date'])

# Получение сегодняшней даты для сравнения
today = pd.to_datetime(datetime.now().strftime('%Y-%m-%d'))

In [51]:
df

           project_name start_date   end_date project_status
0              Веб-сайт 2023-01-10 2023-05-15       Завершен
1  Мобильное приложение 2025-05-20 2025-10-30     В процессе
2           База данных 2024-03-15 2024-12-01       Завершен

In [50]:
df['project_status'] = df.apply(lambda row: 'Завершен' if row['end_date'] < today 
                                else ('В ожидании' if row['start_date'] > today
                                      else 'В процессе'), axis=1)